app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $db = \Config\Database::connect();

        // Total users
        $totalUsers = $this->userModel->countAllResults();
        $totalMerchants = $this->userModel->where('role', 'merchant')->countAllResults();

        // Orders statistics
        $totalOrders = $this->orderModel->countAllResults();
        $pendingOrders = $this->orderModel->where('status', 'pending')->countAllResults();
        $shippedOrders = $this->orderModel->where('status', 'shipped')->countAllResults();

        // Payments waiting for verification
        $pendingPayments = $this->paymentModel->where('status', 'waiting')->countAllResults();

        // Total revenue
        $totalRevenue = $this->orderModel->where('status !=', 'cancelled')->selectSum('total_price')->first()->total_price ?? 0;

        // Products stats
        $totalProducts = $this->productModel->countAllResults();

        // Recent orders
        $recentOrders = $db->table('orders')
                          ->select('orders.*, users.name as user_name')
                          ->join('users', 'users.id = orders.user_id')
                          ->orderBy('orders.created_at', 'DESC')
                          ->limit(5)
                          ->get()
                          ->getResultArray();

        // Recent payments
        $recentPayments = $db->table('payments')
                            ->select('payments.*, orders.total_price, users.name as user_name')
                            ->join('orders', 'orders.id = payments.order_id')
                            ->join('users', 'users.id = payments.user_id')
                            ->orderBy('payments.created_at', 'DESC')
                            ->limit(5)
                            ->get()
                            ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'merchant'
SELECT COUNT(*) AS `numrows`
FROM `orders`
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'shipped'
SELECT COUNT(*) AS `numrows`
FROM `payments`
WHERE `status` = 'waiting'
SELECT SUM(`total_price`) AS `total_price`
FROM `orders`
WHERE `status` != 'cancelled'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `products`
SELECT `orders`.*, `users`.`name` as `user_name`
FROM `orders`
JOIN `users` ON `users`.`id` = `orders`.`user_id`
ORDER BY `orders`.`created_at` DESC
 LIMIT 5
SELECT `payments`.*, `orders`.`total_price`, `users`.`name` as `user_name`
FROM `payments`
JOIN `orders` ON `orders`.`id` = `payments`.`order_id`
JOIN `users` ON `users`.`id` = `payments`.`user_id`
ORDER BY `payments`.`created_at` DESC
 LIMIT 5