app/Controllers/Admin/Orders.php

SELECT `o`.*, `u`.`name` as `user_name`
FROM `orders` as `o`
JOIN `users` as `u` ON `u`.`id` = `o`.`user_id`
ORDER BY `o`.`created_at` DESC
---
    public function index()
    {
        $db = \Config\Database::connect();
        $orders = $db->table('orders as o')
            ->select('o.*, u.name as user_name')
            ->join('users as u', 'u.id = o.user_id')
            ->orderBy('o.created_at', 'DESC')
            ->get()
            ->getResultArray();