app/Controllers/Admin/Reports.php

    public function index()
    {
        // Example report data: total orders, total payments, user count, recent orders
        $totalOrders = $this->orderModel->countAllResults();
        $totalPayments = $this->paymentModel->countAllResults();
        $totalUsers = $this->userModel->countAllResults();

        // Get recent orders with user info
        $db = \Config\Database::connect();
        $recentOrders = $db->table('orders as o')
            ->select('o.*, u.name as user_name')
            ->join('users as u', 'u.id = o.user_id')
            ->orderBy('o.created_at', 'DESC')
            ->limit(5)
            ->get()
            ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `orders`
SELECT COUNT(*) AS `numrows`
FROM `payments`
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT `o`.*, `u`.`name` as `user_name`
FROM `orders` as `o`
JOIN `users` as `u` ON `u`.`id` = `o`.`user_id`
ORDER BY `o`.`created_at` DESC
 LIMIT 5