app/Views/layouts/main.php

SELECT *
FROM `categories`
---
                            <ul class="dropdown-menu" aria-labelledby="categoryDropdown">
                                <?php
                                $db = \Config\Database::connect();
                                $categories = $db->table('categories')->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `cart`
WHERE `user_id` = '7'
---
                            $cartCount = 0;
                            if (session()->get('id')) {
                                $cartModel = new \App\Models\CartModel();
                                $cartCount = $cartModel->where('user_id', session()->get('id'))->countAllResults();